# 1.напечатать сторку в одну линию - C:\WINDOWS\System32\drivers\etc\nst
#
# a='C:\WINDOWS\System32\drivers\etc\nst'
#
# print(type(a))
# print(repr(a))

# 2.на входе a = [4, 3, -10, 1, 7, 12], получить на выходе из этого списка а=[4, -10, 12, 3, 1, 7

# a = [4, 3, -10, 1, 7, 12]
# print(f"First {a}")
# a.sort(key=lambda x: x%2)
# print(f"Then {a}")

# 3.Создать телефонный справочник с возможностью импорта и
# экспорта данных в нескольких форматах. (txt - csv например).

# начала в файле справка
